export const products = [
    {
        id: 1,
        title: "Сухой полнорационный корм для стерилизованных кошек и кастрированных котов",
        image: "test1.png",
        composition: "дегидрированное мясо (в том числе индейка, говядина) - 28%, пшеница, кукуруза, кукурузный глютен, жир индейки, растительные волокна, гидролизованные белки животного происхождения, цельное семя льна, автолизат пивных дрожжей (натуральный источник МОС), масло лососевых рыб, DL-метионин, таурин, топинамбур (натуральный источник ФОС и инулина), витамины и минералы.",
        


    }
]