const data = [
    {
        title: "Сухой полнорационный корм для взрослых кошек всех пород с говядиной",
        image: "взрослые говядина.png",
        composition: "дегидрированное мясо (в том числе индейка, говядина) - 28%, пшеница, кукуруза, кукурузный глютен, жир индейки, растительные волокна, гидролизованные белки животного происхождения, цельное семя льна, автолизат пивных дрожжей (натуральный источник МОС), масло лососевых рыб, DL-метионин, таурин, топинамбур (натуральный источник ФОС и инулина), витамины и минералы.",
        category: "cats",
        description: "Сухой полнорационный корм для взрослых кошек всех пород с говядиной",
        info: ["Говядина и индейка", "Жир индейки", "Пребиотики MOS и FOS", "Профилактика МКБ"],
        theme: "red",
        label: "говядина",
        weight: 0.4,
        _weight_list: [0.4, 1.5, 10],
        nutritional_value: [
            ["Питательная ценность", ""],
            ["сырой белок", "28%"],
            ["сырой жир", "14%"],
            ["сырая клетчатка", "4,3%"],
            ["сырая зола", "6,5%"],
            ["влажность, не более", "10%"],
            ["кальций", "1,30%"],
            ["фосфор", "1,10%"],
            ["Омега 6", "2,4%"],
            ["Омега 3", "0,30%"]
        ],
        microelements: [
            ["Микроэлементы (на 1 кг)", ""],
            ["железо, мг", "260"],
            ["медь, мг", "10"],
            ["цинк, мг", "120"],
            ["магний, мг", "85"],
            ["марганец, мг", "15"],
            ["йод, мкг", "2100"],
            ["селен, мкг", "390"],
        ],
        vitamins: [
            ["Витамины (на 1 кг) ", ""],
            ["витамин А, МЕ", "20000"],
            ["витамин D3, МЕ", "700"],
            ["витамин Е, мг", "150"],
            ["тиамин, мг", "3,5"],
            ["рибофлавин, мг", "3,8"],
            ["пантотеновая кислота, мг", "5"],
            ["ниацин, мг", "46"],
            ["пиридоксин, мг", "4,5"],
            ["фолиевая кислота, мкг", "1400"],
            ["витамин В12, мкг", "32"],
            ["холин, мг", "2200"],
            ["биотин, мг", "0,1"]
        ],
        feed_scheme: [
            ["", "Нормальный вес", "Избыточный вес"],
            ["до 3 кг",	54,	41],
            ["3-5 кг",	"54-77",	"41-57"],
            ["5-7 кг",	"77-96",	"57-72"],
            ["7-9 кг",	"96-114",	"72-85"]
        ]
    },
    {
        title: "Сухой полнорационный корм для взрослых кошек всех пород с ягненком",
        image: "взрослые ягненок.png",
        composition: "дегидрированное мясо (в том числе индейка, ягненок) - 28%, пшеница, кукуруза, кукурузный глютен, жир индейки, растительные волокна, гидролизованные белки животного происхождения, цельное семя льна, автолизат пивных дрожжей (натуральный источник МОС), масло лососевых рыб, DL-метионин, таурин, топинамбур (натуральный источник ФОС и инулина), витамины и минералы.",
        category: "cats",
        description: "Сухой полнорационный корм для взрослых кошек всех пород с ягненком ",
        info: ["Ягненок и индейка", "Жир индейки", "Пребиотики MOS и FOS", "Профилактика МКБ"],
        theme: "fiolet",
        label: "ягненок",
        weight: 0.4,
        _weight_list: [0.4, 1.5, 10],
        nutritional_value: [
            ["Питательная ценность", ""],
            ["сырой белок", "28%"],
            ["сырой жир", "14%"],
            ["сырая клетчатка", "4,3%"],
            ["сырая зола", "6,5%"],
            ["влажность, не более", "10%"],
            ["кальций", "1,30%"],
            ["фосфор", "1,10%"],
            ["Омега 6", "2,4%"],
            ["Омега 3", "0,30%"]
        ],
        microelements: [
            ["Микроэлементы (на 1 кг)", ""],
            ["железо, мг", "260"],
            ["медь, мг", "10"],
            ["цинк, мг", "120"],
            ["магний, мг", "85"],
            ["марганец, мг", "15"],
            ["йод, мкг", "2100"],
            ["селен, мкг", "390"],
        ],
        vitamins: [
            ["Витамины (на 1 кг) ", ""],
            ["витамин А, МЕ", "20000"],
            ["витамин D3, МЕ", "700"],
            ["витамин Е, мг", "150"],
            ["тиамин, мг", "3,5"],
            ["рибофлавин, мг", "3,8"],
            ["пантотеновая кислота, мг", "5"],
            ["ниацин, мг", "46"],
            ["пиридоксин, мг", "4,5"],
            ["фолиевая кислота, мкг", "1400"],
            ["витамин В12, мкг", "32"],
            ["холин, мг", "2200"],
            ["биотин, мг", "0,1"]
        ],
        feed_scheme: [
            ["", "Нормальный вес", "Избыточный вес"],
            ["до 3 кг",	54,	41],
            ["3-5 кг",	"54-77",	"41-57"],
            ["5-7 кг",	"77-96",	"57-72"],
            ["7-9 кг",	"96-114",	"72-85"]
        ]
    },
    {
        title: "Сухой полнорационный корм для стерилизованных кошек - гипоаллергенный",
        image: "гиппоа.png",
        composition: "гидролизованный говяжий белок - 20%, дегидрированное мясо индейки - 10%, пшеница, кукуруза, жир индейки, растительные волокна, гидролизованные белки животного происхождения, цельное семя льна, автолизат пивных дрожжей (натуральный источник МОС), масло лососевых рыб, DL-метионин, таурин, топинамбур (натуральный источник ФОС и инулина), витамины и минералы.",
        category: "cats",
        description: "Сухой полнорационный корм для стерилизованных кошек - гипоаллергенный",
        info: ["Гипоаллергенные белки массов до 80 кДа", "Жир индейки", "Пребиотики MOS и FOS", "Нормализация pH мочи кошки"],
        theme: "blue",
        label: "гипоаллергенный",
        weight: 0.4,
        _weight_list: [0.4, 1.5, 10],
        nutritional_value: [
            ["Питательная ценность", ""],
            ["сырой белок", "30%"],
            ["сырой жир", "13%"],
            ["сырая клетчатка", "4,1%"],
            ["сырая зола", "6,0%"],
            ["влажность, не более", "10%"],
            ["кальций", "0,8%"],
            ["фосфор", "0,6%"],
            ["Омега 6", "2,6%"],
            ["Омега 3", "0,30%"]
        ],
        microelements: [
            ["Микроэлементы (на 1 кг)", ""],
            ["железо, мг", "260"],
            ["медь, мг", "11"],
            ["цинк, мг", "130"],
            ["магний, мг", "80"],
            ["марганец, мг", "15"],
            ["йод, мкг", "2100"],
            ["селен, мкг", "410"],
        ],
        vitamins: [
            ["Витамины (на 1 кг) ", ""],
            ["витамин А, МЕ", "20000"],
            ["витамин D3, МЕ", "700"],
            ["витамин Е, мг", "150"],
            ["тиамин, мг", "3,5"],
            ["рибофлавин, мг", "3,8"],
            ["пантотеновая кислота, мг", "5"],
            ["ниацин, мг", "46"],
            ["пиридоксин, мг", "4,5"],
            ["фолиевая кислота, мкг", "1400"],
            ["витамин В12, мкг", "32"],
            ["холин, мг", "2200"],
            ["биотин, мг", "0,1"]
        ],
        feed_scheme: [
            ["", "Нормальный вес", "Избыточный вес"],
            ["до 3 кг",	49,	37],
            ["3-5 кг",	"49-69",	"37-51"],
            ["5-7 кг",	"69-86",	"51-65"],
            ["7-9 кг",	"86-102",	"65-77"]
        ]
    },
    {
        title: "Сухой полнорационный корм для стерилиз. кошек и кастрированных котов с индейкой",
        image: "стерильные.индейка.png",
        composition: "дегидрированное мясо индейки - 30%, пшеница, кукуруза, кукурузный глютен, жир индейки, растительные волокна, гидролизованные белки животного происхождения, цельное семя льна, автолизат пивных дрожжей (натуральный источник МОС), масло лососевых рыб, DL-метионин, таурин, топинамбур (натуральный источник ФОС и инулина), витамины и минералы.",
        category: "cats",
        description: "Сухой полнорационный корм для стерилизованных кошек и кастрированных котов с индейкой",
        info: ["Монобелок: индейка", "Жир индейки", "Пребиотики MOS и FOS", "Профилактика МКБ"],
        theme: "light",
        label: "индейка",
        weight: 0.4,
        _weight_list: [0.4, 1.5, 10],
        nutritional_value: [
            ["Питательная ценность", ""],
            ["сырой белок", "30%"],
            ["сырой жир", "12%"],
            ["сырая клетчатка", "4,3%"],
            ["сырая зола", "6,5%"],
            ["влажность, не более", "10%"],
            ["кальций", "1,20%"],
            ["фосфор", "1,00%"],
            ["Омега 6", "2,6%"],
            ["Омега 3", "0,30%"]
        ],
        microelements: [
            ["Микроэлементы (на 1 кг)", ""],
            ["железо, мг", "250"],
            ["медь, мг", "11"],
            ["цинк, мг", "120"],
            ["магний, мг", "95"],
            ["марганец, мг", "15"],
            ["йод, мкг", "2100"],
            ["селен, мкг", "390"],
        ],
        vitamins: [
            ["Витамины (на 1 кг) ", ""],
            ["витамин А, МЕ", "20000"],
            ["витамин D3, МЕ", "700"],
            ["витамин Е, мг", "150"],
            ["тиамин, мг", "3,5"],
            ["рибофлавин, мг", "3,8"],
            ["пантотеновая кислота, мг", "5"],
            ["ниацин, мг", "46"],
            ["пиридоксин, мг", "4,5"],
            ["фолиевая кислота, мкг", "1400"],
            ["витамин В12, мкг", "32"],
            ["холин, мг", "2200"],
            ["биотин, мг", "0,1"]
        ],
        feed_scheme: [
            ["", "Нормальный вес", "Избыточный вес"],
            ["до 3 кг",	54,	41],
            ["3-5 кг",	"54-77",	"41-57"],
            ["5-7 кг",	"77-96",	"57-72"],
            ["7-9 кг",	"96-114",	"72-85"]
        ]
    },
    {
        title: "Сухой полнорационный корм для стерилиз. кошек и кастрированных котов с ягненком",
        image: "стерильные.ягненок.png",
        composition: "дегидрированное мясо индейки - 30%, пшеница, кукуруза, кукурузный глютен, жир индейки, растительные волокна, гидролизованные белки животного происхождения, цельное семя льна, автолизат пивных дрожжей (натуральный источник МОС), масло лососевых рыб, DL-метионин, таурин, топинамбур (натуральный источник ФОС и инулина), витамины и минералы.",
        category: "cats",
        description: "Сухой полнорационный корм для стерилизованных кошек и кастрированных котов с ягненком",
        info: ["Ягненок и индейка", "Жир индейки", "Пребиотики MOS и FOS", "Профилактика МКБ"],
        theme: "light_fiolet",
        label: "ягненок",
        weight: 0.4,
        _weight_list: [0.4, 1.5, 10],
        nutritional_value: [
            ["Питательная ценность", ""],
            ["сырой белок", "30%"],
            ["сырой жир", "12%"],
            ["сырая клетчатка", "4,3%"],
            ["сырая зола", "6,5%"],
            ["влажность, не более", "10%"],
            ["кальций", "1,20%"],
            ["фосфор", "1,00%"],
            ["Омега 6", "2,6%"],
            ["Омега 3", "0,30%"]
        ],
        microelements: [
            ["Микроэлементы (на 1 кг)", ""],
            ["железо, мг", "250"],
            ["медь, мг", "11"],
            ["цинк, мг", "120"],
            ["магний, мг", "95"],
            ["марганец, мг", "15"],
            ["йод, мкг", "2100"],
            ["селен, мкг", "390"],
        ],
        vitamins: [
            ["Витамины (на 1 кг) ", ""],
            ["витамин А, МЕ", "20000"],
            ["витамин D3, МЕ", "700"],
            ["витамин Е, мг", "150"],
            ["тиамин, мг", "3,5"],
            ["рибофлавин, мг", "3,8"],
            ["пантотеновая кислота, мг", "5"],
            ["ниацин, мг", "46"],
            ["пиридоксин, мг", "4,5"],
            ["фолиевая кислота, мкг", "1400"],
            ["витамин В12, мкг", "32"],
            ["холин, мг", "2200"],
            ["биотин, мг", "0,1"]
        ],
        feed_scheme: [
            ["", "Нормальный вес", "Избыточный вес"],
            ["до 3 кг",	54,	41],
            ["3-5 кг",	"54-77",	"41-57"],
            ["5-7 кг",	"77-96",	"57-72"],
            ["7-9 кг",	"96-114",	"72-85"]
        ]
    },
    {
        title: "Сухой полнорационный корм для стерилизованных кошек - профилактика МКБ",
        image: "уринари.png",
        composition: "дегидрированное мясо -32% (в том числе говядина 18%, индейка 14%), пшеница, кукуруза, жир индейки, растительные волокна, гидролизованные белки животного происхождения, цельное семя льна, автолизат пивных дрожжей (натуральный источник МОС), масло лососевых рыб, цитрат калия, хондроитина сульфат, DL-метионин, экстракт клюквы, таурин, топинамбур (натуральный источник ФОС и инулина), витамины и минералы.",
        category: "cats",
        description: "Сухой полнорационный корм для стерилизованных кошек - профилактика МКБ",
        info: ["Сниженное кол-во кальция, фосфора и магния", "Восстановление защитного слоя мочевого пузыря", "Снижение воспаления в мочеполовой системе", "Нормализация pH мочи кошки"],
        theme: "blue",
        label: "уринари",
        weight: 0.4,
        _weight_list: [0.4, 1.5, 10],
        nutritional_value: [
            ["Питательная ценность", ""],
            ["сырой белок", "32%"],
            ["сырой жир", "10%"],
            ["сырая клетчатка", "4,3%"],
            ["сырая зола", "5,4%"],
            ["влажность, не более", "10%"],
            ["кальций", "0,8%"],
            ["фосфор", "0,6%"],
            ["Омега 6", "2,4%"],
            ["Омега 3", "0,35%"]
        ],
        microelements: [
            ["Микроэлементы (на 1 кг)", ""],
            ["железо, мг", "260"],
            ["медь, мг", "11"],
            ["цинк, мг", "130"],
            ["магний, мг", "80"],
            ["марганец, мг", "15"],
            ["йод, мкг", "2100"],
            ["селен, мкг", "410"],
        ],
        vitamins: [
            ["Витамины (на 1 кг) ", ""],
            ["витамин А, МЕ", "20000"],
            ["витамин D3, МЕ", "700"],
            ["витамин Е, мг", "150"],
            ["тиамин, мг", "3,5"],
            ["рибофлавин, мг", "3,8"],
            ["пантотеновая кислота, мг", "5"],
            ["ниацин, мг", "46"],
            ["пиридоксин, мг", "4,5"],
            ["фолиевая кислота, мкг", "1400"],
            ["витамин В12, мкг", "32"],
            ["холин, мг", "2200"],
            ["биотин, мг", "0,1"]
        ],
        feed_scheme: [
            ["", "Нормальный вес", "Избыточный вес"],
            ["до 3 кг",	54,	41],
            ["3-5 кг",	"54-77",	"41-57"],
            ["5-7 кг",	"77-96",	"57-72"],
            ["7-9 кг",	"96-114",	"72-85"]
        ]
    },
    {
        title: "Сухой полнорационный корм для котят - индейка и говядина",
        image: "котята говядина.png",
        composition: "дегидрированное мясо - 40% (в том числе индейка - 27%, говядина -13 %), пшеница, кукуруза, жир индейки, растительные волокна, гидролизованные белки животного происхождения, цельное семя льна, автолизат пивных дрожжей (натуральный источник МОС), масло лососевых рыб, DL-метионин, таурин, топинамбур (натуральный источник ФОС и инулина), L-карнитин, витамины и минералы.",
        category: "cats",
        description: "Сухой полнорационный корм для котят - индейка и говядина",
        info: ["Говядина и индейка", "Жир индейки", "Пребиотики MOS и FOS", "Оптимизация метаболизма"],
        theme: "pink",
        label: "говядина",
        weight: 0.4,
        _weight_list: [0.4, 1.5, 10],
        nutritional_value: [
            ["Питательная ценность", ""],
            ["сырой белок", "33%"],
            ["сырой жир", "16%"],
            ["сырая клетчатка", "3,6%"],
            ["сырая зола", "7,6%"],
            ["влажность, не более", "10%"],
            ["кальций", "1,4%"],
            ["фосфор", "1,2%"],
            ["Омега 6", "2,9%"],
            ["Омега 3", "0,4%"]
        ],
        microelements: [
            ["Микроэлементы (на 1 кг)", ""],
            ["железо, мг", "280"],
            ["медь, мг", "12"],
            ["цинк, мг", "140"],
            ["магний, мг", "88"],
            ["марганец, мг", "16"],
            ["йод, мкг", "2200"],
            ["селен, мкг", "420"],
        ],
        vitamins: [
            ["Витамины (на 1 кг) ", ""],
            ["витамин А, МЕ", "22000"],
            ["витамин D3, МЕ", "800"],
            ["витамин Е, мг", "170"],
            ["тиамин, мг", "3,8"],
            ["рибофлавин, мг", "4,2"],
            ["пантотеновая кислота, мг", "5,5"],
            ["ниацин, мг", "50"],
            ["пиридоксин, мг", "5"],
            ["фолиевая кислота, мкг", "1500"],
            ["витамин В12, мкг", "35"],
            ["холин, мг", "2200"],
            ["биотин, мг", "0,12"]
        ],
        feed_scheme_kitten: [
            ["", "Нормальный вес", "Избыточный вес"],
            ["0.5",	40,	"", ""],
            ["1",	"49",	"40", ""],
            ["1.5",	"64",	"56", "45"],
            ["2",	"84",	"70", "55"],
            ["2.5",	"",	"80", "65"],
            ["3",	"",	"94", "75"],
            ["3.5",	"",	"104", "85"],
            ["4",	"",	"", "90"],
            ["4.5",	"",	"", "100"]
        ]
    },



    // собаки
    {
        title: "Сухой полнорационный корм для взрослых собак средних и крупных пород  - мясное ассорти",
        image: "мясное ассорти взрослые.jpg",
        composition: "дегидрированное мясо (в том числе индейка, ягненок, говядина) - 25%, пшеница, кукуруза, жир индейки, растительные волокна, гидролизованные белки животного происхождения, цельное семя льна, автолизат пивных дрожжей (натуральный источник МОС), масло лососевых рыб, DL-метионин, топинамбур (натуральный источник ФОС и инулина), глюкозамин, хондроитин, витамины и минералы.",
        category: "dogs",
        description: "Сухой полнорационный корм для взрослых собак средних и крупных пород",
        info: ["Ягнёнок, говядина и индейка", "Жир индейки", "Пребиотики MOS и FOS", "Оптимизация метаболизма"],
        theme: "pink",
        weight: 2,
        _weight_list: [2, 10],
        label: "ассорти",
        nutritional_value: [
            ["Питательная ценность", ""],
            ["сырой белок", "23%"],
            ["сырой жир", "12%"],
            ["сырая клетчатка", "4,2%"],
            ["сырая зола", "6,0%"],
            ["влажность, не более", "10%"],
            ["кальций", "1,30%"],
            ["фосфор", "1,05%"],
            ["Омега 6", "2,70%"],
            ["Омега 3", "0,30%"]
        ],
        microelements: [
            ["Микроэлементы (на 1 кг)", ""],
            ["железо, мг", "170"],
            ["медь, мг", "11"],
            ["цинк, мг", "120"],
            ["марганец, мг", "10"],
            ["йод, мкг", "1500"],
            ["селен, мкг", "380"],
        ],
        vitamins: [
            ["Витамины (на 1 кг) ", ""],
            ["витамин А, МЕ", "15000"],
            ["витамин D3, МЕ", "900"],
            ["витамин Е, мг", "120"],
            ["тиамин, мг", "6,7"],
            ["рибофлавин, мг", "8"],
            ["пантотеновая кислота, мг", "19"],
            ["ниацин, мг", "22"],
            ["пиридоксин, мг", "3,5"],
            ["фолиевая кислота, мкг", "590"],
            ["витамин В12, мкг", "52"],
            ["холин, мг", "2200"]
        ],
        feed_scheme: [
            ["Вес собаки", "Низкая активность", "Умеренная активность"],
            ["11-12",	139,	165],
            ["13-14",	130,	185],
            ["15-16",	144,	201],
            ["17-18",	189,	223],
            ["19-20",	203,	240],
            ["21-22",	218,	257],
            ["23-24",	232,	273],
            ["25-26",	240,	282],
        ]
    },
    {
        title: "Сухой полнорационный корм для взрослых собак средних и крупных пород с ягненком",
        image: "ягненок взрослые.png",
        composition: "дегидрированное мясо (в том числе индейка, ягненок) - 25%, пшеница, кукуруза, жир индейки, растительные волокна, гидролизованные белки животного происхождения, цельное семя льна, автолизат пивных дрожжей (натуральный источник МОС), масло лососевых рыб, DL-метионин, топинамбур (натуральный источник ФОС и инулина), глюкозамин, хондроитин, витамины и минералы.",
        category: "dogs",
        description: "Сухой полнорационный корм для взрослых собак средних и крупных пород с ягненком",
        info: ["Ягнёнок, говядина и индейка", "Жир индейки", "Пребиотики MOS и FOS", "Оптимизация метаболизма"],
        theme: "fiolet",
        label: "ягненок",
        weight: 2,
        _weight_list: [2, 10],
        nutritional_value: [
            ["Питательная ценность", ""],
            ["сырой белок", "24%"],
            ["сырой жир", "12%"],
            ["сырая клетчатка", "4,0%"],
            ["сырая зола", "6,0%"],
            ["влажность, не более", "10%"],
            ["кальций", "1,20%"],
            ["фосфор", "1,00%"],
            ["Омега 6", "2,70%"],
            ["Омега 3", "0,30%"]
        ],
        microelements: [
            ["Микроэлементы (на 1 кг)", ""],
            ["железо, мг", "160"],
            ["медь, мг", "11"],
            ["цинк, мг", "120"],
            ["марганец, мг", "10"],
            ["йод, мкг", "1500"],
            ["селен, мкг", "380"],
        ],
        vitamins: [
            ["Витамины (на 1 кг) ", ""],
            ["витамин А, МЕ", "15000"],
            ["витамин D3, МЕ", "900"],
            ["витамин Е, мг", "120"],
            ["тиамин, мг", "6,7"],
            ["рибофлавин, мг", "8"],
            ["пантотеновая кислота, мг", "19"],
            ["ниацин, мг", "22"],
            ["пиридоксин, мг", "3,5"],
            ["фолиевая кислота, мкг", "590"],
            ["витамин В12, мкг", "52"],
            ["холин, мг", "2000"]
        ],
        feed_scheme: [
            ["Вес собаки", "Низкая активность", "Умеренная активность"],
            ["11-12",	139,	165],
            ["13-14",	130,	185],
            ["15-16",	144,	201],
            ["17-18",	189,	223],
            ["19-20",	203,	240],
            ["21-22",	218,	257],
            ["23-24",	232,	273],
            ["25-26",	240,	282],
        ]
    },
    {
        title: "Сухой полнорационный корм для щенков всех пород - монопротеин индейка",
        image: "малые породы индейка .png",
        composition: "дегидрированное мясо индейки - 35%, пшеница, кукуруза, жир индейки, растительные волокна, гидролизованные белки животного происхождения, цельное семя льна, автолизат пивных дрожжей (натуральный источник МОС), масло лососевых рыб, DL-метионин, топинамбур (натуральный источник ФОС и инулина), лецитин, L-лизин, глюкозамин, хондроитин, витамины и минералы.",
        category: "dogs",
        description: "Сухой полнорационный корм для щенков всех пород - монопротеин индейка",
        info: ["Монобелок: индейка", "Жир индейки", "Пребиотики MOS и FOS", "Здоровье суставов и связок"],
        theme: "yellow",
        label: "индейка",
        weight: 2,
        _weight_list: [2, 10],
        nutritional_value: [
            ["Питательная ценность", ""],
            ["сырой белок", "28%"],
            ["сырой жир", "15%"],
            ["сырая клетчатка", "4,2%"],
            ["сырая зола", "7,5%"],
            ["влажность, не более", "10%"],
            ["кальций", "1,40%"],
            ["фосфор", "1,10%"],
            ["Омега 6", "3,0%"],
            ["Омега 3", "0,30%"]
        ],
        microelements: [
            ["Микроэлементы (на 1 кг)", ""],
            ["железо, мг", "180"],
            ["медь, мг", "18"],
            ["цинк, мг", "105"],
            ["марганец, мг", "9"],
            ["йод, мкг", "1600"],
            ["селен, мкг", "400"],
        ],
        vitamins: [
            ["Витамины (на 1 кг) ", ""],
            ["витамин А, МЕ", "16000"],
            ["витамин D3, МЕ", "1000"],
            ["витамин Е, мг", "150"],
            ["тиамин, мг", "8"],
            ["рибофлавин, мг", "8,2"],
            ["пантотеновая кислота, мг", "20"],
            ["ниацин, мг", "25"],
            ["пиридоксин, мг", "4"],
            ["фолиевая кислота, мкг", "500"],
            ["витамин В12, мкг", "52"],
            ["холин, мг", "2000"]
        ],
        feed_scheme: [
            ["Вес собаки", "Низкая активность", "Умеренная активность"],
            ["3",	67,	86],
            ["4",	81,	103],
            ["5",	97,	126],
            ["6",	110,	142],
            ["7",	127,	160],
            ["8",	140,	177],
            ["9",	153,	191],
            ["10",	164,	207],
        ]
    },
    {
        id: 4,
        title: "Сухой полнорационный корм для взрослых собак мелких пород с индейкой монопротеин",
        image: "малые породы индейка .png",
        composition: "дегидрированное мясо индейки - 27%, пшеница, кукуруза, жир индейки, растительные волокна, гидролизованные белки животного происхождения, цельное семя льна, автолизат пивных дрожжей (натуральный источник МОС), масло лососевых рыб, DL-метионин, топинамбур (натуральный источник ФОС и инулина), глюкозамин, хондроитин, витамины и минералы.",
        category: "dogs",
        description: "Сухой полнорационный корм для взрослых собак мелких пород с индейкой монопротеин",
        info: ["Монобелок: индейка", "Жир индейки", "Пребиотики MOS и FOS", "Здоровье суставов и связок"],
        theme: "yellow",
        label: "индейка",
        weight: 2,
        _weight_list: [2, 10],
        nutritional_value: [
            ["Питательная ценность", ""],
            ["сырой белок", "24%"],
            ["сырой жир", "14%"],
            ["сырая клетчатка", "4,0%"],
            ["сырая зола", "6,5%"],
            ["влажность, не более", "10%"],
            ["кальций", "1,30%"],
            ["фосфор", "1,10%"],
            ["Омега 6", "3,0%"],
            ["Омега 3", "0,30%"]
        ],
        microelements: [
            ["Микроэлементы (на 1 кг)", ""],
            ["железо, мг", "160"],
            ["медь, мг", "11"],
            ["цинк, мг", "120"],
            ["марганец, мг", "10"],
            ["йод, мкг", "1600"],
            ["селен, мкг", "380"],
        ],
        vitamins: [
            ["Витамины (на 1 кг) ", ""],
            ["витамин А, МЕ", "15000"],
            ["витамин D3, МЕ", "1000"],
            ["витамин Е, мг", "120"],
            ["тиамин, мг", "6,7"],
            ["рибофлавин, мг", "8"],
            ["пантотеновая кислота, мг", "19"],
            ["ниацин, мг", "22"],
            ["пиридоксин, мг", "3,5"],
            ["фолиевая кислота, мкг", "590"],
            ["витамин В12, мкг", "52"],
            ["холин, мг", "2000"]
        ],
        feed_scheme: [
            ["Вес собаки", "Нормальная активность", "Умеренная активность"],
            ["1",	36,	48],
            ["2",	49,	63],
            ["3",	67,	86],
            ["4",	81,	103],
            ["5",	97,	126],
            ["6",	110,	142],
            ["7",	127,	160],
            ["8",	140,	177],
            ["9",	153,	191],
            ["10",	164,	207],
        ]
    },
    
]



const get_weight = (title, weight) => {
    let s
    if (weight < 1) {
        s = `${weight}г`
    }
    else {
        s = `${weight}кг`
    }
    return `${title} - ${s}`
}

const get_image_link = (category, weight, image) => {
    let c;
    if (category == "cats") {
        c = "кошки"
    }
    else if (category == "dogs") {
        c = "собаки"
    }
    else {
        alert(`шибка с категорией ${category}`)
    }

    return `/${c}/${weight}/${image}`
}

let count = 0;
const get_index = () => {
    count += 1
    return count
}


export const products = data.flatMap((item, index) =>
    item._weight_list.map((w, index2) => ({
        ...item,
        weight: w,
        id: get_index(),
        title: get_weight(item.title, w),
        image: get_image_link(item.category, w, item.image)
    }))
);

console.log(products);
